ЭкзаменационнаяЗадача/src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <attributes>
    <name>Авторы</name>
    <type>
      <types>CatalogRef.Авторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </attributes>
  <attributes>
    <name>Издательство</name>
    <type>
      <types>CatalogRef.Издательство</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКниги</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЭкзаменационнаяЗадача/src/Catalogs/Книги/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
// Создание новой книги.
// 
// Параметры:
//  СтруктураКниги Структура книги
Процедура СозданиеНовойКниги(СтруктураКниги) Экспорт

	НоваяКнига 					= Справочники.Книги.СоздатьЭлемент();
	НоваяКнига.Наименование 	= СтруктураКниги.Наименование;
	НоваяКнига.Авторы 			= СтруктураКниги.АвторыСсылка;
	НоваяКнига.ОписаниеКниги 	= СтруктураКниги.Описание;
	НоваяКнига.Описание 		= Новый ХранилищеЗначения(СтруктураКниги.Описание);
	НоваяКнига.КодISBN 			= СтруктураКниги.КодISBN;
	НоваяКнига.Жанр 			= СтруктураКниги.ЖанрыСсылка;
	НоваяКнига.Издательство 	= СтруктураКниги.ИздательствоСсылка;
	НоваяКнига.ГодВыпуска 		= СтруктураКниги.ГодВыпуска;
	НоваяКнига.Записать();

КонецПроцедуры

// Редактирование книги.
// 
// Параметры:
//  СтруктураКниги Структура книги
Процедура РедактированиеКниги(СтруктураКниги) Экспорт

	КнигаРедактируемая 					= СтруктураКниги.Ссылка.ПолучитьОбъект();
	КнигаРедактируемая.Наименование 	= СтруктураКниги.Наименование;
	КнигаРедактируемая.Авторы 			= СтруктураКниги.АвторыСсылка;
	КнигаРедактируемая.ОписаниеКниги 	= СтруктураКниги.Описание;
	КнигаРедактируемая.Описание 		= Новый ХранилищеЗначения(СтруктураКниги.Описание);
	КнигаРедактируемая.Жанр 			= СтруктураКниги.ЖанрыСсылка;
	КнигаРедактируемая.Издательство 	= СтруктураКниги.ИздательствоСсылка;
	КнигаРедактируемая.ГодВыпуска 		= СтруктураКниги.ГодВыпуска;
	КнигаРедактируемая.Записать();

КонецПроцедуры

#КонецОбласти
